// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.WriteLine("Введите число: ");
int Number = int.Parse(Console.ReadLine());

if (Number > 99)
{
    while ()
    {

    }
}
else
{
    Console.WriteLine("Третьей цифры нет");
}
